PGM

DCL VAR(&FTPIP) TYPE(*CHAR) LEN(15) VALUE('11.12.14.68')
DCL VAR(&USER) TYPE(*CHAR) LEN(10) VALUE('yourUser')
DCL VAR(&PASSWORD) TYPE(*CHAR) LEN(10) VALUE('yourPassword')
DCL VAR(&CMD) TYPE(*CHAR) LEN(100)

OVRDBF FILE(INPUT) TOFILE(QTEMP/FTPINPUT)
OVRDBF FILE(OUTPUT) TOFILE(QTEMP/FTPOUTPUT)

CRTPF FILE(QTEMP/FTPINPUT) RCDLEN(80)

ADDSTRPFM FILE(QTEMP/FTPINPUT) +
          SRCMBR(FTPCMDS) +
          SRCDTA('user ' *CAT &USER)
ADDSTRPFM FILE(QTEMP/FTPINPUT) +
          SRCMBR(FTPCMDS) +
          SRCDTA(&PASSWORD)
ADDSTRPFM FILE(QTEMP/FTPINPUT) +
          SRCMBR(FTPCMDS) +
          SRCDTA('bin')
ADDSTRPFM FILE(QTEMP/FTPINPUT) +
          SRCMBR(FTPCMDS) +
          SRCDTA('put LIB/OBJSAVF')
ADDSTRPFM FILE(QTEMP/FTPINPUT) +
          SRCMBR(FTPCMDS) +
          SRCDTA('quit')

CALL PGM(QTCP/QTMFTP) PARM(&FTPIP)

DLTOVR FILE(INPUT)
DLTOVR FILE(OUTPUT)

ENDPGM

----
PGM

DCL VAR(&USER) TYPE(*CHAR) LEN(10) VALUE('yourUser')
DCL VAR(&PASSWORD) TYPE(*CHAR) LEN(10) VALUE('yourPassword')
DCL VAR(&IP) TYPE(*CHAR) LEN(15) VALUE('11.12.14.68')
DCL VAR(&CMD) TYPE(*CHAR) LEN(100)

CHGVAR VAR(&CMD) VALUE('FTP RMTSYS(' *CAT &IP *CAT ')')
SBMJOB CMD(&CMD) JOB(FTPJOB)

MONMSG MSGID(CPF0000)

CALL PGM(QSYS/QTMFPUTF) PARM(&USER &PASSWORD 'BIN' 'PUT LIB/OBJSAVF' 'QUIT')

ENDPGM
